OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c765.h
extern __at(0x009F) volatile __ADCON1bits_t ADCON1bits;

#define _PCFG0                  0x01
#define _PCFG1                  0x02
#define _PCFG2                  0x04

//==============================================================================


//==============================================================================
//        UIR Bits

extern __at(0x0190) __sfr UIR;

typedef struct
  {
  unsigned USB_RST              : 1;
  unsigned UERR                 : 1;
  unsigned ACTIVITY             : 1;
  unsigned TOK_DNE              : 1;
  unsigned UIDLE                : 1;
  unsigned STALL                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UIRbits_t;

extern __at(0x0190) volatile __UIRbits_t UIRbits;

#define _UIR_USB_RST            0x01
#define _UIR_UERR               0x02
#define _UIR_ACTIVITY           0x04
#define _UIR_TOK_DNE            0x08
#define _UIR_UIDLE              0x10
#define _UIR_STALL              0x20

//==============================================================================


//==============================================================================
//        UIE Bits

extern __at(0x0191) __sfr UIE;

typedef struct
  {
  unsigned USB_RST              : 1;
  unsigned UERR                 : 1;
  unsigned ACTIVITY             : 1;
  unsigned TOK_DNE              : 1;
  unsigned UIDLE                : 1;
  unsigned STALL                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UIEbits_t;

extern __at(0x0191) volatile __UIEbits_t UIEbits;

#define _USB_RST                0x01
#define _UERR                   0x02
#define _ACTIVITY               0x04
#define _TOK_DNE                0x08
#define _UIDLE                  0x10
#define _STALL                  0x20

//==============================================================================


//==============================================================================
//        UEIR Bits

extern __at(0x0192) __sfr UEIR;

typedef struct
  {
  unsigned PID_ERR              : 1;
  unsigned CRC5                 : 1;
  unsigned CRC16                : 1;
  unsigned DFN8                 : 1;
  unsigned BTO_ERR              : 1;
  unsigned WRT_ERR              : 1;
  unsigned OWN_ERR              : 1;
  unsigned BTS_ERR              : 1;
  } __UEIRbits_t;

extern __at(0x0192) volatile __UEIRbits_t UEIRbits;

#define _UEIR_PID_ERR           0x01
#define _UEIR_CRC5              0x02
#define _UEIR_CRC16             0x04
#define _UEIR_DFN8              0x08
#define _UEIR_BTO_ERR           0x10
#define _UEIR_WRT_ERR           0x20
#define _UEIR_OWN_ERR           0x40
#define _UEIR_BTS_ERR           0x80

//==============================================================================


//==============================================================================
//        UEIE Bits

extern __at(0x0193) __sfr UEIE;

typedef struct
  {
  unsigned PID_ERR              : 1;
  unsigned CRC5                 : 1;
  unsigned CRC16                : 1;
  unsigned DFN8                 : 1;
  unsigned BTO_ERR              : 1;
  unsigned WRT_ERR              : 1;
  unsigned OWN_ERR              : 1;
  unsigned BTS_ERR              : 1;
  } __UEIEbits_t;

extern __at(0x0193) volatile __UEIEbits_t UEIEbits;

#define _PID_ERR                0x01
#define _CRC5                   0x02
#define _CRC16                  0x04
#define _DFN8                   0x08
#define _BTO_ERR                0x10
#define _WRT_ERR                0x20
#define _OWN_ERR                0x40
#define _BTS_ERR                0x80

//==============================================================================


//==============================================================================
//        USTAT Bits

extern __at(0x0194) __sfr USTAT;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned IN                 : 1;
    unsigned ENDP0              : 1;
    unsigned ENDP1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned ENDP               : 2;
    unsigned                    : 3;
    };
  } __USTATbits_t;

extern __at(0x0194) volatile __USTATbits_t USTATbits;

#define _IN                     0x04
#define _ENDP0                  0x08
#define _ENDP1                  0x10

//==============================================================================


//==============================================================================
//        UCTRL Bits

extern __at(0x0195) __sfr UCTRL;

typedef struct
  {
  unsigned                      : 1;
  unsigned SUSPND               : 1;
  unsigned RESUME               : 1;
  unsigned DEV_ATT              : 1;
  unsigned PKT_DIS              : 1;
  unsigned SE0                  : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UCTRLbits_t;

extern __at(0x0195) volatile __UCTRLbits_t UCTRLbits;

#define _SUSPND                 0x02
#define _RESUME                 0x04
#define _DEV_ATT                0x08
#define _PKT_DIS                0x10
#define _SE0                    0x20

//==============================================================================

extern __at(0x0196) __sfr UADDR;
extern __at(0x0197) __sfr USWSTAT;

//==============================================================================
//        UEP0 Bits

extern __at(0x0198) __sfr UEP0;

typedef struct
  {
  unsigned EP_STALL             : 1;
  unsigned EP_IN_EN             : 1;
  unsigned EP_OUT_EN            : 1;
  unsigned EP_CTL_DIS           : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UEP0bits_t;

extern __at(0x0198) volatile __UEP0bits_t UEP0bits;

#define _EP_STALL               0x01
#define _EP_IN_EN               0x02
#define _EP_OUT_EN              0x04
#define _EP_CTL_DIS             0x08

//==============================================================================


//==============================================================================
//        UEP1 Bits

extern __at(0x0199) __sfr UEP1;

typedef struct
  {
  unsigned EP_STALL             : 1;
  unsigned EP_IN_EN             : 1;
  unsigned EP_OUT_EN            : 1;
  unsigned EP_CTL_DIS           : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UEP1bits_t;

extern __at(0x0199) volatile __UEP1bits_t UEP1bits;

#define _UEP1_EP_STALL          0x01
#define _UEP1_EP_IN_EN          0x02
#define _UEP1_EP_OUT_EN         0x04
#define _UEP1_EP_CTL_DIS        0x08

//==============================================================================


//==============================================================================
//        UEP2 Bits

extern __at(0x019A) __sfr UEP2;

typedef struct
  {
  unsigned EP_STALL             : 1;
  unsigned EP_IN_EN             : 1;
  unsigned EP_OUT_EN            : 1;
  unsigned EP_CTL_DIS           : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UEP2bits_t;

extern __at(0x019A) volatile __UEP2bits_t UEP2bits;

#define _UEP2_EP_STALL          0x01
#define _UEP2_EP_IN_EN          0x02
#define _UEP2_EP_OUT_EN         0x04
#define _UEP2_EP_CTL_DIS        0x08

//==============================================================================


//==============================================================================
//        BD0OST Bits

extern __at(0x01A0) __sfr BD0OST;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0_BSTALL        : 1;
    unsigned PID1_DTS           : 1;
    unsigned PID2               : 1;
    unsigned PID3               : 1;
    unsigned DATA0_1            : 1;
    unsigned UOWN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0               : 1;
    unsigned PID1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA01             : 1;
    unsigned OWN                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BSTALL             : 1;
    unsigned DTS                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PID                : 4;
    unsigned                    : 2;
    };
  } __BD0OSTbits_t;

