OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c765.h
extern __at(0x01A0) volatile __BD0OSTbits_t BD0OSTbits;

#define _BD0OST_PID0_BSTALL     0x04
#define _BD0OST_PID0            0x04
#define _BD0OST_BSTALL          0x04
#define _BD0OST_PID1_DTS        0x08
#define _BD0OST_PID1            0x08
#define _BD0OST_DTS             0x08
#define _BD0OST_PID2            0x10
#define _BD0OST_PID3            0x20
#define _BD0OST_DATA0_1         0x40
#define _BD0OST_DATA01          0x40
#define _BD0OST_UOWN            0x80
#define _BD0OST_OWN             0x80

//==============================================================================


//==============================================================================
//        BD0OBC Bits

extern __at(0x01A1) __sfr BD0OBC;

typedef union
  {
  struct
    {
    unsigned BC0                : 1;
    unsigned BC1                : 1;
    unsigned BC2                : 1;
    unsigned BC3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BC                 : 4;
    unsigned                    : 4;
    };
  } __BD0OBCbits_t;

extern __at(0x01A1) volatile __BD0OBCbits_t BD0OBCbits;

#define _BD0OBC_BC0             0x01
#define _BD0OBC_BC1             0x02
#define _BD0OBC_BC2             0x04
#define _BD0OBC_BC3             0x08

//==============================================================================

extern __at(0x01A2) __sfr BD0OAL;

//==============================================================================
//        BD0IST Bits

extern __at(0x01A4) __sfr BD0IST;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0_BSTALL        : 1;
    unsigned PID1_DTS           : 1;
    unsigned PID2               : 1;
    unsigned PID3               : 1;
    unsigned DATA0_1            : 1;
    unsigned UOWN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0               : 1;
    unsigned PID1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA01             : 1;
    unsigned OWN                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BSTALL             : 1;
    unsigned DTS                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PID                : 4;
    unsigned                    : 2;
    };
  } __BD0ISTbits_t;

extern __at(0x01A4) volatile __BD0ISTbits_t BD0ISTbits;

#define _PID0_BSTALL            0x04
#define _PID0                   0x04
#define _BSTALL                 0x04
#define _PID1_DTS               0x08
#define _PID1                   0x08
#define _DTS                    0x08
#define _PID2                   0x10
#define _PID3                   0x20
#define _DATA0_1                0x40
#define _DATA01                 0x40
#define _UOWN                   0x80
#define _OWN                    0x80

//==============================================================================


//==============================================================================
//        BD0IBC Bits

extern __at(0x01A5) __sfr BD0IBC;

typedef union
  {
  struct
    {
    unsigned BC0                : 1;
    unsigned BC1                : 1;
    unsigned BC2                : 1;
    unsigned BC3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BC                 : 4;
    unsigned                    : 4;
    };
  } __BD0IBCbits_t;

extern __at(0x01A5) volatile __BD0IBCbits_t BD0IBCbits;

#define _BC0                    0x01
#define _BC1                    0x02
#define _BC2                    0x04
#define _BC3                    0x08

//==============================================================================

extern __at(0x01A6) __sfr BD0IAL;

//==============================================================================
//        BD1OST Bits

extern __at(0x01A8) __sfr BD1OST;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0_BSTALL        : 1;
    unsigned PID1_DTS           : 1;
    unsigned PID2               : 1;
    unsigned PID3               : 1;
    unsigned DATA0_1            : 1;
    unsigned UOWN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0               : 1;
    unsigned PID1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA01             : 1;
    unsigned OWN                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BSTALL             : 1;
    unsigned DTS                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PID                : 4;
    unsigned                    : 2;
    };
  } __BD1OSTbits_t;

extern __at(0x01A8) volatile __BD1OSTbits_t BD1OSTbits;

#define _BD1OST_PID0_BSTALL     0x04
#define _BD1OST_PID0            0x04
#define _BD1OST_BSTALL          0x04
#define _BD1OST_PID1_DTS        0x08
#define _BD1OST_PID1            0x08
#define _BD1OST_DTS             0x08
#define _BD1OST_PID2            0x10
#define _BD1OST_PID3            0x20
#define _BD1OST_DATA0_1         0x40
#define _BD1OST_DATA01          0x40
#define _BD1OST_UOWN            0x80
#define _BD1OST_OWN             0x80

//==============================================================================


//==============================================================================
//        BD1OBC Bits

