OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c765.h
extern __at(0x01B1) volatile __BD2OBCbits_t BD2OBCbits;

#define _BD2OBC_BC0             0x01
#define _BD2OBC_BC1             0x02
#define _BD2OBC_BC2             0x04
#define _BD2OBC_BC3             0x08

//==============================================================================

extern __at(0x01B2) __sfr BD2OAL;

//==============================================================================
//        BD2IST Bits

extern __at(0x01B4) __sfr BD2IST;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0_BSTALL        : 1;
    unsigned PID1_DTS           : 1;
    unsigned PID2               : 1;
    unsigned PID3               : 1;
    unsigned DATA0_1            : 1;
    unsigned UOWN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PID0               : 1;
    unsigned PID1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA01             : 1;
    unsigned OWN                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BSTALL             : 1;
    unsigned DTS                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PID                : 4;
    unsigned                    : 2;
    };
  } __BD2ISTbits_t;

extern __at(0x01B4) volatile __BD2ISTbits_t BD2ISTbits;

#define _BD2IST_PID0_BSTALL     0x04
#define _BD2IST_PID0            0x04
#define _BD2IST_BSTALL          0x04
#define _BD2IST_PID1_DTS        0x08
#define _BD2IST_PID1            0x08
#define _BD2IST_DTS             0x08
#define _BD2IST_PID2            0x10
#define _BD2IST_PID3            0x20
#define _BD2IST_DATA0_1         0x40
#define _BD2IST_DATA01          0x40
#define _BD2IST_UOWN            0x80
#define _BD2IST_OWN             0x80

//==============================================================================


//==============================================================================
//        BD2IBC Bits

extern __at(0x01B5) __sfr BD2IBC;

typedef union
  {
  struct
    {
    unsigned BC0                : 1;
    unsigned BC1                : 1;
    unsigned BC2                : 1;
    unsigned BC3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BC                 : 4;
    unsigned                    : 4;
    };
  } __BD2IBCbits_t;

extern __at(0x01B5) volatile __BD2IBCbits_t BD2IBCbits;

#define _BD2IBC_BC0             0x01
#define _BD2IBC_BC1             0x02
#define _BD2IBC_BC2             0x04
#define _BD2IBC_BC3             0x08

//==============================================================================

extern __at(0x01B6) __sfr BD2IAL;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG1                0x2007

//----------------------------- CONFIG1 Options -------------------------------

#define _FOSC_HS                0x3FFC  // HS oscillator.
#define _HS_OSC                 0x3FFC  // HS oscillator.
#define _FOSC_EC                0x3FFD  // External clock. CLKOUT on OSC2 pin.
#define _EC_OSC                 0x3FFD  // External clock. CLKOUT on OSC2 pin.
#define _FOSC_H4                0x3FFE  // HS osc with 4x PLL enabled.
#define _H4_OSC                 0x3FFE  // HS osc with 4x PLL enabled.
#define _FOSC_E4                0x3FFF  // External clock with 4x PLL enabled. CLKOUT on OSC2 pin.
#define _E4_OSC                 0x3FFF  // External clock with 4x PLL enabled. CLKOUT on OSC2 pin.
#define _WDTE_OFF               0x3FFB  // WDT disabled.
#define _WDT_OFF                0x3FFB  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FF7  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _CP_ALL                 0x00CF  // All memory is code protected.
#define _CP_75                  0x15DF  // 0800h-1FFFh code protected.
#define _CP_50                  0x2AEF  // 1000h-1FFFh code protected.
#define _CP_OFF                 0x3FFF  // Code protection off.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 2, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 2, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 2, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 2, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 3
#define CHS1                    ADCON0bits.CHS1                 // bit 4
#define CHS2                    ADCON0bits.CHS2                 // bit 5
#define ADCS0                   ADCON0bits.ADCS0                // bit 6
#define ADCS1                   ADCON0bits.ADCS1                // bit 7

#define PCFG0                   ADCON1bits.PCFG0                // bit 0
#define PCFG1                   ADCON1bits.PCFG1                // bit 1
#define PCFG2                   ADCON1bits.PCFG2                // bit 2

#define BC0                     BD0IBCbits.BC0                  // bit 0
#define BC1                     BD0IBCbits.BC1                  // bit 1
#define BC2                     BD0IBCbits.BC2                  // bit 2
#define BC3                     BD0IBCbits.BC3                  // bit 3

